#### BuiltInParameterGroup Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum BuiltInParameterGroup ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration BuiltInParameterGroup ``` |

| Visual C++ |
| --- |
| ``` public enum class BuiltInParameterGroup ``` |

# Members

| Member name | Description |
| --- | --- |
| PG\_LIFE\_SAFETY | "Life Safety" |
| PG\_ELECTRICAL\_ANALYSIS | "Electrical Analysis" |
| PG\_ALTERNATE\_UNITS | "Alternate Units" |
| PG\_PRIMARY\_UNITS | "Primary Units" |
| PG\_WALL\_CROSS\_SECTION\_DEFINITION | "Cross-Section Definition" |
| PG\_ROUTE\_ANALYSIS | "Route Analysis" |
| PG\_GEO\_LOCATION | "Geolocation" |
| PG\_STRUCTURAL\_SECTION\_GEOMETRY | "Structural Section Geometry" |
| PG\_ENERGY\_ANALYSIS\_BLDG\_CONS\_MTL\_THERMAL\_PROPS | "Material Thermal Properties" |
| PG\_ENERGY\_ANALYSIS\_ROOM\_SPACE\_DATA | "Room/Space Data" |
| PG\_ENERGY\_ANALYSIS\_BUILDING\_DATA | "Building Data" |
| PG\_COUPLER\_ARRAY | "Set" |
| PG\_ENERGY\_ANALYSIS\_ADVANCED | "Advanced" |
| PG\_RELEASES\_MEMBER\_FORCES | "Releases / Member Forces" |
| PG\_SECONDARY\_END | "Secondary End" |
| PG\_PRIMARY\_END | "Primary End" |
| PG\_MOMENTS | "Moments" |
| PG\_FORCES | "Forces" |
| PG\_FABRICATION\_PRODUCT\_DATA | "Fabrication Product Data" |
| PG\_REFERENCE | "Reference" |
| PG\_GEOMETRY\_POSITIONING | "Geometric Position" |
| PG\_DIVISION\_GEOMETRY | "Division Geometry" |
| PG\_SEGMENTS\_FITTINGS | "Segments and Fittings" |
| PG\_CONTINUOUSRAIL\_END\_TOP\_EXTENSION | "Extension (End/Top)" |
| PG\_CONTINUOUSRAIL\_BEGIN\_BOTTOM\_EXTENSION | "Extension (Beginning/Bottom)" |
| PG\_STAIRS\_WINDERS | "Winders" |
| PG\_STAIRS\_SUPPORTS | "Supports" |
| PG\_STAIRS\_OPEN\_END\_CONNECTION | "End Connection" |
| PG\_RAILING\_SYSTEM\_SECONDARY\_FAMILY\_HANDRAILS | "Handrail 2" |
| PG\_TERMINATION | "Terminations" |
| PG\_STAIRS\_TREADS\_RISERS | "Threads/Risers" |
| PG\_STAIRS\_CALCULATOR\_RULES | "Calculation Rules" |
| PG\_SPLIT\_PROFILE\_DIMENSIONS | "Dimensions (linear units or % of thickness)" |
| PG\_LENGTH | "Length" |
| PG\_NODES | "Nodes" |
| PG\_ANALYTICAL\_PROPERTIES | "Analytical Properties" |
| PG\_ANALYTICAL\_ALIGNMENT | "Analytical Alignment" |
| PG\_SYSTEMTYPE\_RISEDROP | "Rise / Drop" |
| PG\_LINING | "Lining" |
| PG\_INSULATION | "Insulation" |
| PG\_OVERALL\_LEGEND | "Overall Legend" |
| PG\_VISIBILITY | "Visibility" |
| PG\_SUPPORT | "Supports" |
| PG\_RAILING\_SYSTEM\_SEGMENT\_V\_GRID | "V Grid" |
| PG\_RAILING\_SYSTEM\_SEGMENT\_U\_GRID | "U Grid" |
| PG\_RAILING\_SYSTEM\_SEGMENT\_POSTS | "Posts" |
| PG\_RAILING\_SYSTEM\_SEGMENT\_PATTERN\_REMAINDER | "Pattern Remainder" |
| PG\_RAILING\_SYSTEM\_SEGMENT\_PATTERN\_REPEAT | "Pattern Repeat" |
| PG\_RAILING\_SYSTEM\_FAMILY\_SEGMENT\_PATTERN | "Segment Pattern (default)" |
| PG\_RAILING\_SYSTEM\_FAMILY\_HANDRAILS | "Handrail 1" |
| PG\_RAILING\_SYSTEM\_FAMILY\_TOP\_RAIL | "Top Rail" |
| PG\_CONCEPTUAL\_ENERGY\_DATA\_BUILDING\_SERVICES | "Energy Model - Building Services" |
| PG\_DATA | "Data" |
| PG\_ELECTRICAL\_CIRCUITING | "Electrical - Circuiting" |
| PG\_GENERAL | "General" |
| PG\_FLEXIBLE | "Adaptive Component" |
| PG\_ENERGY\_ANALYSIS\_CONCEPTUAL\_MODEL | "Energy Analytical Model" |
| PG\_ENERGY\_ANALYSIS\_DETAILED\_MODEL | "Detailed Model" |
| PG\_ENERGY\_ANALYSIS\_DETAILED\_AND\_CONCEPTUAL\_MODELS | "Essential" |
| PG\_FITTING | "Fittings" |
| PG\_CONCEPTUAL\_ENERGY\_DATA | "Conceptual Energy Data" |
| PG\_AREA | "Area" |
| PG\_ADSK\_MODEL\_PROPERTIES | "Model Properties" |
| PG\_CURTAIN\_GRID\_V | "V Grid" |
| PG\_CURTAIN\_GRID\_U | "U Grid" |
| PG\_DISPLAY | "Display" |
| PG\_ANALYSIS\_RESULTS | "Analysis Results" |
| PG\_SLAB\_SHAPE\_EDIT | "Slab Shape Edit" |
| PG\_LIGHT\_PHOTOMETRICS | "Photometrics" |
| PG\_PATTERN\_APPLICATION | "Pattern Application" |
| PG\_GREEN\_BUILDING | "Green Building Properties" |
| PG\_PROFILE\_2 | "Profile 2" |
| PG\_PROFILE\_1 | "Profile 1" |
| PG\_PROFILE | "Profile" |
| PG\_TRUSS\_FAMILY\_BOTTOM\_CHORD | "Bottom Chords" |
| PG\_TRUSS\_FAMILY\_TOP\_CHORD | "Top Chords" |
| PG\_TRUSS\_FAMILY\_DIAG\_WEB | "Diagonal Webs" |
| PG\_TRUSS\_FAMILY\_VERT\_WEB | "Vertical Webs" |
| PG\_TITLE | "Title Text" |
| PG\_FIRE\_PROTECTION | "Fire Protection" |
| PG\_ROTATION\_ABOUT | "Rotation about" |
| PG\_TRANSLATION\_IN | "Translation in" |
| PG\_ANALYTICAL\_MODEL | "Analytical Model" |
| PG\_REBAR\_ARRAY | "Rebar Set" |
| PG\_REBAR\_SYSTEM\_LAYERS | "Layers" |
| PG\_CURTAIN\_GRID | "Grid" |
| PG\_CURTAIN\_MULLION\_2 | "Grid 2 Mullions" |
| PG\_CURTAIN\_MULLION\_HORIZ | "Horizontal Mullions" |
| PG\_CURTAIN\_MULLION\_1 | "Grid 1 Mullions" |
| PG\_CURTAIN\_MULLION\_VERT | "Vertical Mullions" |
| PG\_CURTAIN\_GRID\_2 | "Grid 2" |
| PG\_CURTAIN\_GRID\_HORIZ | "Horizontal Grid" |
| PG\_CURTAIN\_GRID\_1 | "Grid 1" |
| PG\_CURTAIN\_GRID\_VERT | "Vertical Grid" |
| PG\_IFC | "IFC Parameters" |
| PG\_ELECTRICAL | "Electrical" |
| PG\_ENERGY\_ANALYSIS | "Energy Analysis" |
| PG\_STRUCTURAL\_ANALYSIS | "Structural Analysis" |
| PG\_MECHANICAL\_AIRFLOW | "Mechanical - Flow" |
| PG\_MECHANICAL\_LOADS | "Mechanical - Loads" |
| PG\_ELECTRICAL\_LOADS | "Electrical - Loads" |
| PG\_ELECTRICAL\_LIGHTING | "Electrical - Lighting" |
| PG\_TEXT | "Text" |
| PG\_VIEW\_CAMERA | "Camera" |
| PG\_VIEW\_EXTENTS | "Extents" |
| PG\_PATTERN | "Pattern" |
| PG\_CONSTRAINTS | "Constraints" |
| PG\_PHASING | "Phasing" |
| PG\_MECHANICAL | "Mechanical" |
| PG\_STRUCTURAL | "Structural" |
| PG\_PLUMBING | "Plumbing" |
| PG\_ELECTRICAL\_ENGINEERING | "Electrical Engineering" |
| PG\_STAIR\_STRINGERS | "Stringers" |
| PG\_STAIR\_RISERS | "Risers" |
| PG\_STAIR\_TREADS | "Treads" |
| PG\_UNDERLAY | "Underlay" |
| PG\_MATERIALS | "Materials and Finishes" |
| PG\_GRAPHICS | "Graphics" |
| PG\_CONSTRUCTION | "Construction" |
| PG\_GEOMETRY | "Dimensions" |
| PG\_IDENTITY\_DATA | "Identity Data" |
| INVALID |  |

# Remarks

Parameter groups are used to sort parameters within the Element Properties dialog.

# See Also

Autodesk.Revit.DB Namespace